{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.6.0", "userDefinedMetadata": {"signature": {"outputs": {"conv2d_9/Sigmoid:0": {"name": "conv2d_9/Sigmoid:0"}}}}, "modelTopology": {"node": [{"name": "batch_normalization_8/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "conv2d_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "conv2d_6/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/BiasAdd", "op": "_FusedConv2D", "input": ["input_1", "conv2d_1/kernel", "conv2d_1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_1/batchnorm/mul", "conv2d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_1/batchnorm/mul_1", "batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_1/Relu", "op": "Relu", "input": ["batch_normalization_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/BiasAdd", "op": "_FusedConv2D", "input": ["activation_1/Relu", "conv2d_2/kernel", "conv2d_2/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "batch_normalization_2/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_2/batchnorm/mul", "conv2d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_2/batchnorm/mul_1", "batch_normalization_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_2/Relu", "op": "Relu", "input": ["batch_normalization_2/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/BiasAdd", "op": "_FusedConv2D", "input": ["activation_2/Relu", "conv2d_3/kernel", "conv2d_3/bias"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "batch_normalization_3/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_3/batchnorm/mul", "conv2d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_3/batchnorm/mul_1", "batch_normalization_3/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_3/Relu", "op": "Relu", "input": ["batch_normalization_3/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/BiasAdd", "op": "_FusedConv2D", "input": ["activation_3/Relu", "conv2d_4/kernel", "conv2d_4/bias"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_4/batchnorm/mul", "conv2d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_4/batchnorm/mul_1", "batch_normalization_4/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_4/Relu", "op": "Relu", "input": ["batch_normalization_4/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/BiasAdd", "op": "_FusedConv2D", "input": ["activation_4/Relu", "conv2d_5/kernel", "conv2d_5/bias"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_5/batchnorm/mul", "conv2d_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_5/batchnorm/mul_1", "batch_normalization_5/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_5/Relu", "op": "Relu", "input": ["batch_normalization_5/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/BiasAdd", "op": "_FusedConv2D", "input": ["activation_5/Relu", "conv2d_6/kernel", "conv2d_6/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "batch_normalization_6/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_6/batchnorm/mul", "conv2d_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_6/batchnorm/mul_1", "batch_normalization_6/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_6/Relu", "op": "Relu", "input": ["batch_normalization_6/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/BiasAdd", "op": "_FusedConv2D", "input": ["activation_6/Relu", "conv2d_7/kernel", "conv2d_7/bias"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_7/batchnorm/mul", "conv2d_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_7/batchnorm/mul_1", "batch_normalization_7/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_7/Relu", "op": "Relu", "input": ["batch_normalization_7/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/BiasAdd", "op": "_FusedConv2D", "input": ["activation_7/Relu", "conv2d_8/kernel", "conv2d_8/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_8/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_8/batchnorm/mul", "conv2d_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_8/batchnorm/mul_1", "batch_normalization_8/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_8/Relu", "op": "Relu", "input": ["batch_normalization_8/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/BiasAdd", "op": "_FusedConv2D", "input": ["activation_8/Relu", "conv2d_9/kernel", "conv2d_9/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "conv2d_9/Sigmoid", "op": "Sigmoid", "input": ["conv2d_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_8/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.34724411368370056, "scale": 0.006593421510621613, "dtype": "uint8"}}, {"name": "batch_normalization_7/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.43843308091163635, "scale": 0.005501803580452414, "dtype": "uint8"}}, {"name": "batch_normalization_6/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.528627336025238, "scale": 0.005934260172002456, "dtype": "uint8"}}, {"name": "batch_normalization_5/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.5462834239006042, "scale": 0.005597038128796745, "dtype": "uint8"}}, {"name": "batch_normalization_4/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.5304462909698486, "scale": 0.004385982307733274, "dtype": "uint8"}}, {"name": "batch_normalization_3/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.5889930725097656, "scale": 0.0057839842403636255, "dtype": "uint8"}}, {"name": "batch_normalization_2/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.6990300416946411, "scale": 0.00632779972226012, "dtype": "uint8"}}, {"name": "batch_normalization_1/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 7.890889644622803, "scale": 0.05924604266297583, "dtype": "uint8"}}, {"name": "conv2d_1/kernel", "shape": [9, 9, 1, 64], "dtype": "float32", "quantization": {"min": -0.10108798721841737, "scale": 0.0007716640245680716, "dtype": "uint8"}}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0062295847882827115, "scale": 5.234945200237573e-05, "dtype": "uint8"}}, {"name": "batch_normalization_1/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -5.8111618004593195, "scale": 0.04336687910790537, "dtype": "uint8"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.17325576128912906, "scale": 0.0012464443258210724, "dtype": "uint8"}}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.00044587645474273495, "scale": 2.7523237947082403e-06, "dtype": "uint8"}}, {"name": "batch_normalization_2/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -1.4620447350483314, "scale": 0.020028010069155226, "dtype": "uint8"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.14592317763496848, "scale": 0.0010574143306881774, "dtype": "uint8"}}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.00037828212662134315, "scale": 2.3495784262195228e-06, "dtype": "uint8"}}, {"name": "batch_normalization_3/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -1.5078035303190642, "scale": 0.011872468742669798, "dtype": "uint8"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.11091998578870997, "scale": 0.0009017885023472356, "dtype": "uint8"}}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.00020615667762125239, "scale": 1.7772127381142448e-06, "dtype": "uint8"}}, {"name": "batch_normalization_4/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -0.8172326929428998, "scale": 0.010896435905905331, "dtype": "uint8"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.10885661805377286, "scale": 0.0008850131549087225, "dtype": "uint8"}}, {"name": "conv2d_5/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.00027576926342376016, "scale": 2.3370276561335608e-06, "dtype": "uint8"}}, {"name": "batch_normalization_5/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -0.7415835202908984, "scale": 0.00938713316823922, "dtype": "uint8"}}, {"name": "conv2d_6/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.1041595857517392, "scale": 0.0008399966592882194, "dtype": "uint8"}}, {"name": "conv2d_6/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.00026136801495928977, "scale": 1.8536738649595018e-06, "dtype": "uint8"}}, {"name": "batch_normalization_6/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -1.3063975558561436, "scale": 0.012096273665334663, "dtype": "uint8"}}, {"name": "conv2d_7/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.12231547499404234, "scale": 0.000970757738047955, "dtype": "uint8"}}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.00019325245543857855, "scale": 1.5840365199883488e-06, "dtype": "uint8"}}, {"name": "batch_normalization_7/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -0.8816401932753769, "scale": 0.009688353772256889, "dtype": "uint8"}}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.1259309496949701, "scale": 0.0010763329033758127, "dtype": "uint8"}}, {"name": "conv2d_8/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0005013486413814712, "scale": 3.7414077715035164e-06, "dtype": "uint8"}}, {"name": "batch_normalization_8/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -2.079282725091074, "scale": 0.015177246168547985, "dtype": "uint8"}}, {"name": "conv2d_9/kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"min": -0.08197611161306793, "scale": 0.0008197611161306793, "dtype": "uint8"}}, {"name": "conv2d_9/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.021539950743317604, "scale": 1.0, "dtype": "uint8"}}]}]}