{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.6.0", "userDefinedMetadata": {"signature": {"outputs": {"conv2d_9/Sigmoid:0": {"name": "conv2d_9/Sigmoid:0"}}}}, "modelTopology": {"node": [{"name": "batch_normalization_8/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "batch_normalization_5/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "batch_normalization_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "conv2d_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "batch_normalization_4/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}}}, {"name": "conv2d_9/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, {"name": "conv2d_1/BiasAdd", "op": "_FusedConv2D", "input": ["input_1", "conv2d_1/kernel", "conv2d_1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_1/batchnorm/mul", "conv2d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_1/batchnorm/mul_1", "batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_1/Relu", "op": "Relu", "input": ["batch_normalization_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/BiasAdd", "op": "_FusedConv2D", "input": ["activation_1/Relu", "conv2d_2/kernel", "conv2d_2/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_2/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_2/batchnorm/mul", "conv2d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_2/batchnorm/mul_1", "batch_normalization_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_2/Relu", "op": "Relu", "input": ["batch_normalization_2/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/BiasAdd", "op": "_FusedConv2D", "input": ["activation_2/Relu", "conv2d_3/kernel", "conv2d_3/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_3/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_3/batchnorm/mul", "conv2d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_3/batchnorm/mul_1", "batch_normalization_3/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_3/Relu", "op": "Relu", "input": ["batch_normalization_3/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/BiasAdd", "op": "_FusedConv2D", "input": ["activation_3/Relu", "conv2d_4/kernel", "conv2d_4/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "batch_normalization_4/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_4/batchnorm/mul", "conv2d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_4/batchnorm/mul_1", "batch_normalization_4/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_4/Relu", "op": "Relu", "input": ["batch_normalization_4/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/BiasAdd", "op": "_FusedConv2D", "input": ["activation_4/Relu", "conv2d_5/kernel", "conv2d_5/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_5/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_5/batchnorm/mul", "conv2d_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_5/batchnorm/mul_1", "batch_normalization_5/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_5/Relu", "op": "Relu", "input": ["batch_normalization_5/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/BiasAdd", "op": "_FusedConv2D", "input": ["activation_5/Relu", "conv2d_6/kernel", "conv2d_6/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_6/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_6/batchnorm/mul", "conv2d_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_6/batchnorm/mul_1", "batch_normalization_6/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_6/Relu", "op": "Relu", "input": ["batch_normalization_6/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/BiasAdd", "op": "_FusedConv2D", "input": ["activation_6/Relu", "conv2d_7/kernel", "conv2d_7/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "batch_normalization_7/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_7/batchnorm/mul", "conv2d_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_7/batchnorm/mul_1", "batch_normalization_7/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_7/Relu", "op": "Relu", "input": ["batch_normalization_7/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/BiasAdd", "op": "_FusedConv2D", "input": ["activation_7/Relu", "conv2d_8/kernel", "conv2d_8/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "batch_normalization_8/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_8/batchnorm/mul", "conv2d_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_8/batchnorm/mul_1", "batch_normalization_8/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_8/Relu", "op": "Relu", "input": ["batch_normalization_8/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/BiasAdd", "op": "_FusedConv2D", "input": ["activation_8/Relu", "conv2d_9/kernel", "conv2d_9/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "conv2d_9/Sigmoid", "op": "Sigmoid", "input": ["conv2d_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_8/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.34724411368370056, "scale": 2.565533661720472e-05, "dtype": "uint16"}}, {"name": "batch_normalization_7/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.43843308091163635, "scale": 2.1407796032888772e-05, "dtype": "uint16"}}, {"name": "batch_normalization_6/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.528627336025238, "scale": 2.3090506505846133e-05, "dtype": "uint16"}}, {"name": "batch_normalization_5/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.5462834239006042, "scale": 2.1778358477808348e-05, "dtype": "uint16"}}, {"name": "batch_normalization_4/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.5304462909698486, "scale": 1.706607901841741e-05, "dtype": "uint16"}}, {"name": "batch_normalization_3/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.5889930725097656, "scale": 2.2505775254333174e-05, "dtype": "uint16"}}, {"name": "batch_normalization_2/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 0.6990300416946411, "scale": 2.4621788802568558e-05, "dtype": "uint16"}}, {"name": "batch_normalization_1/batchnorm/mul", "shape": [64], "dtype": "float32", "quantization": {"min": 7.890889644622803, "scale": 0.00023052934888317445, "dtype": "uint16"}}, {"name": "conv2d_1/kernel", "shape": [9, 9, 1, 64], "dtype": "float32", "quantization": {"min": -0.10096488128453687, "scale": 3.002583753183158e-06, "dtype": "uint16"}}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.006204734075659017, "scale": 2.0369436576799897e-07, "dtype": "uint16"}}, {"name": "batch_normalization_1/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -5.802555921725844, "scale": 0.00016874272026422323, "dtype": "uint16"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.17297931254760457, "scale": 4.849977921482772e-06, "dtype": "uint16"}}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0004450089908230019, "scale": 1.0709431107814164e-08, "dtype": "uint16"}}, {"name": "batch_normalization_2/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -1.464382635056404, "scale": 7.793000026908648e-05, "dtype": "uint16"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.14583265967669945, "scale": 4.11445264859213e-06, "dtype": "uint16"}}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.00037892208961681155, "scale": 9.14232850669075e-09, "dtype": "uint16"}}, {"name": "batch_normalization_3/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -1.511868811444959, "scale": 4.619637643062178e-05, "dtype": "uint16"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.11100419950099144, "scale": 3.508904678393913e-06, "dtype": "uint16"}}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.00020651626930367242, "scale": 6.915224661923132e-09, "dtype": "uint16"}}, {"name": "batch_normalization_4/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -0.8137136105297086, "scale": 4.239858329146043e-05, "dtype": "uint16"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.1092216429347858, "scale": 3.4436309529522277e-06, "dtype": "uint16"}}, {"name": "conv2d_5/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0002761057226583008, "scale": 9.093492825422414e-09, "dtype": "uint16"}}, {"name": "batch_normalization_5/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -0.7433732849805625, "scale": 3.652580999314871e-05, "dtype": "uint16"}}, {"name": "conv2d_6/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.10377063788226333, "scale": 3.2684694913938497e-06, "dtype": "uint16"}}, {"name": "conv2d_6/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0002608342722900018, "scale": 7.212738774161485e-09, "dtype": "uint16"}}, {"name": "batch_normalization_6/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -1.3052208755385042, "scale": 4.706721270558235e-05, "dtype": "uint16"}}, {"name": "conv2d_7/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.1219075301080144, "scale": 3.7772674632216152e-06, "dtype": "uint16"}}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0001938811391935934, "scale": 6.163566225635598e-09, "dtype": "uint16"}}, {"name": "batch_normalization_7/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -0.8859000531052018, "scale": 3.7697874600221356e-05, "dtype": "uint16"}}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.12620736203591484, "scale": 4.188065771890322e-06, "dtype": "uint16"}}, {"name": "conv2d_8/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0005004606029609975, "scale": 1.455800689300979e-08, "dtype": "uint16"}}, {"name": "batch_normalization_8/batchnorm/sub", "shape": [64], "dtype": "float32", "quantization": {"min": -2.0860150444031924, "scale": 5.905543256244352e-05, "dtype": "uint16"}}, {"name": "conv2d_9/kernel", "shape": [3, 3, 64, 1], "dtype": "float32", "quantization": {"min": -0.08203033705654739, "scale": 3.189731969380075e-06, "dtype": "uint16"}}, {"name": "conv2d_9/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.021539950743317604, "scale": 1.0, "dtype": "uint16"}}]}]}